org/articles/learnmap.org
* Self-Directed Reading in Computational Cognitive Science

I am in a somewhat unusual situation employment-wise right now - you could think of my current role as an "applied grad student" of sorts. This is (I think) particularly well-suited to my personality, but jumping back into this sort of half-academia world is inspiring a good amount of motivation (read: terror) about the body of information I need to be learning at the moment. 

Ergo, I think it is a good idea to actively keep track of the things I need to read, since the queue is constantly growing and keeping it all bottled in my head stresses me out. Books you read reduce your list of books to read by one book, but typically lead you to one-or-more books in return, and your priority list shifts accordingly whenever you consume any resource in this way.

** Goals

The nice thing about my current position is that I have a good amount of control over where I can direct my learning - as long as I am useful enough in front of a keyboard, I am free to optimize my research interest in whatever direction I feel is most interesting / most lucrative. 

At the time of writing (2019/06/25) my broad, ordered list of priorities is as follows:

1. Become good enough at machine learning / artificial intelligence / etc to be good at my job
2. Direct studies towards computational cognitive science, aiming to contribute to research in artificial intelligence through that lens
3. Become good enough at math to deeply understand AI

I care deeply about these three things, in this order. The three of them are connected, so they should all be done relatively concurrently with a sort of weighted time/effort/attention heuristic applied to it. Likewise, there are a plethora of resources which probably could be well captured by multiple categories, so I'll have to use some judgment calls for organizational purposes (since org documents are hierarchical).

** How To Use This Document

This document is primarily intended to be used as an emacs org-mode document, mostly just so you can collapse the bullet points down easily. I expect this document to get pretty long, and it will be fairly difficult to manage to order them in a way that appropriately conveys the intellectual dependencies required to read things effectively. I will try to order things within subcategories in a top-to-bottom fashion within each subsection (such that the harder things to read are lower along the list) and make annotations when that is not possible, but if you're curious about the order I actually read things then I encourage you to check [[http://planetbanatt.net/links.html][my links page]], and start from around February 2019 (you'll have to wade through my other links, though).

Generally speaking, if you see something with [ ] next to it, I have not completed it. If you see something with [X] next to it, I have completed it to my own satisfaction. If you see something which is listed in the syllabus which has neither of these things next to it, it is probably a paper which I read in something which /does/ have one of those two things, most likely a reading list which may or may not be in the "Archive" section now.

Philosophically, I am trying to keep this a pretty non-easily-outmodable syllabus. That is to say, I've tried to avoid including papers which I believe will become outdated once they are replaced by some new state of the art. There are some exceptions to this (i.e. some of the Deep Learning stuff which is too practical to omit) but the idea here is I'd like this document to be useful to people aside from myself, and it would be sad if everything I write down here just becomes worthless to anybody but me at that time.

It should go without saying, but if a resource includes non-optional readings or exercises, do them unless told otherwise - I can't be bothered to reprint all of them here.

** Current Priorities
   - deeplearningbook.org
   - /All Of Statistics/
   - BJS Grad Student Readings - Statistics
   - Elements of Statistical Learning

** Syllabus

*** Artificial Intelligence

My goals with learning Artificial Intelligence are a little bit less academic than the other categories in this document; I am currently more interested in getting the bat into my hands, so to speak, to use AI as a tool with which I can solve problems I am confronted with. Learning these things in a rigorous, disciplined manner is still important, but I lean less theoretical with this point on my self-imposed learning triangle compared to cogsci and math.

**** Machine Learning and Artificial Intelligence
     - [ ] Pattern Recognition and Machine Learning (Bishop)
     - [ ] Artificial Intelligence: A Modern Approach (Russell and Norvig)

**** Deep Learning
     - [X] [[deeplearning.ai]]
     - [ ] [[https://www.deeplearningbook.org/][Deeplearningbook]]

