articles/learnmap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>learnmap</title>
<!-- 2019-09-08 Sun 00:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="ambi" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="./css/default.css" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content">
<h1 class="title">learnmap</h1>
<div id="table-of-contents">
<h1>Table of Contents</h1>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Self-Directed Reading in Computational Cognitive Science</a>
<ul>
<li><a href="#sec-1-1">Goals</a></li>
<li><a href="#sec-1-2">How To Use This Document</a></li>
<li><a href="#sec-1-3">Current Priorities</a></li>
<li><a href="#sec-1-4">Syllabus</a>
<ul>
<li><a href="#sec-1-4-1">Artificial Intelligence</a>
<ul>
<li><a href="#sec-1-4-1-1">Machine Learning and Artificial Intelligence</a></li>
<li><a href="#sec-1-4-1-2">Deep Learning</a></li>
<li><a href="#sec-1-4-1-3">Reinforcement Learning</a></li>
<li><a href="#sec-1-4-1-4">Smaller Fields</a></li>
</ul>
</li>
<li><a href="#sec-1-4-2">Cognitive Science</a>
<ul>
<li><a href="#sec-1-4-2-1">Books and Textbooks</a>
<ul>
<li><a href="#sec-1-4-2-1-1">Computational Cognitive Science</a></li>
<li><a href="#sec-1-4-2-1-2">Scientific Practice</a></li>
</ul>
</li>
<li><a href="#sec-1-4-2-2">Reading Lists</a></li>
<li><a href="#sec-1-4-2-3">Course Syllabi w/ lists of readings</a></li>
<li><a href="#sec-1-4-2-4">Specific People I am Interested In</a></li>
<li><a href="#sec-1-4-2-5">Papers</a>
<ul>
<li><a href="#sec-1-4-2-5-1">Scientific Methodology</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-4-3">Math</a>
<ul>
<li><a href="#sec-1-4-3-1">More Basic</a></li>
<li><a href="#sec-1-4-3-2">Higher</a></li>
<li><a href="#sec-1-4-3-3">Fundamentals</a></li>
<li><a href="#sec-1-4-3-4">Statistics</a>
<ul>
<li><a href="#sec-1-4-3-4-1">Textbooks</a></li>
<li><a href="#sec-1-4-3-4-2">Papers</a></li>
</ul>
</li>
<li><a href="#sec-1-4-3-5">Logic</a></li>
<li><a href="#sec-1-4-3-6">Applied Math</a></li>
<li><a href="#sec-1-4-3-7">Reference</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-5">Other Resources</a>
<ul>
<li><a href="#sec-1-5-1">Videos</a></li>
<li><a href="#sec-1-5-2">Books</a></li>
</ul>
</li>
<li><a href="#sec-1-6">Archive</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-1">
<h1 id="sec-1">Self-Directed Reading in Computational Cognitive Science</h1>
<div class="outline-text-1" id="text-1">
<p>
I am in a somewhat unusual situation employment-wise right now - you could think of my current role as an "applied grad student" of sorts. This is (I think) particularly well-suited to my personality, but jumping back into this sort of half-academia world is inspiring a good amount of motivation (read: terror) about the body of information I need to be learning at the moment. 
</p>

<p>
Ergo, I think it is a good idea to actively keep track of the things I need to read, since the queue is constantly growing and keeping it all bottled in my head stresses me out. Books you read reduce your list of books to read by one book, but typically lead you to one-or-more books in return, and your priority list shifts accordingly whenever you consume any resource in this way.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-2">
<h2 id="sec-1-1">Goals</h2>
<div class="outline-text-2" id="text-1-1">
<p>
The nice thing about my current position is that I have a good amount of control over where I can direct my learning - as long as I am useful enough in front of a keyboard, I am free to optimize my research interest in whatever direction I feel is most interesting / most lucrative. 
</p>

<p>
At the time of writing (2019/06/25) my broad, ordered list of priorities is as follows:
</p>

<ol class="org-ol">
<li>Become good enough at machine learning / artificial intelligence / etc to be good at my job
</li>
<li>Direct studies towards computational cognitive science, aiming to contribute to research in artificial intelligence through that lens
</li>
<li>Become good enough at math to deeply understand AI
</li>
</ol>

<p>
I care deeply about these three things, in this order. The three of them are connected, so they should all be done relatively concurrently with a sort of weighted time/effort/attention heuristic applied to it. Likewise, there are a plethora of resources which probably could be well captured by multiple categories, so I'll have to use some judgment calls for organizational purposes (since org documents are hierarchical).
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-2">
<h2 id="sec-1-2">How To Use This Document</h2>
<div class="outline-text-2" id="text-1-2">
<p>
This document is primarily intended to be used as an emacs org-mode document, mostly just so you can collapse the bullet points down easily. I expect this document to get pretty long, and it will be fairly difficult to manage to order them in a way that appropriately conveys the intellectual dependencies required to read things effectively. I will try to order things within subcategories in a top-to-bottom fashion within each subsection (such that the harder things to read are lower along the list) and make annotations when that is not possible, but if you're curious about the order I actually read things then I encourage you to check <a href="http://planetbanatt.net/links.html">my links page</a>, and start from around February 2019 (you'll have to wade through my other links, though).
</p>

<p>
Generally speaking, if you see something with [ ] next to it, I have not completed it. If you see something with [X] next to it, I have completed it to my own satisfaction. If you see something which is listed in the syllabus which has neither of these things next to it, it is probably a paper which I read in something which <i>does</i> have one of those two things, most likely a reading list which may or may not be in the "Archive" section now.
</p>

<p>
Philosophically, I am trying to keep this a pretty non-easily-outmodable syllabus. That is to say, I've tried to avoid including papers which I believe will become outdated once they are replaced by some new state of the art. There are some exceptions to this (i.e. some of the Deep Learning stuff which is too practical to omit) but the idea here is I'd like this document to be useful to people aside from myself, and it would be sad if everything I write down here just becomes worthless to anybody but me at that time.
</p>

<p>
It should go without saying, but if a resource includes non-optional readings or exercises, do them unless told otherwise - I can't be bothered to reprint all of them here.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-2">
<h2 id="sec-1-3">Current Priorities</h2>
<div class="outline-text-2" id="text-1-3">
<ul class="org-ul">
<li>deeplearningbook.org
</li>
<li><i>All Of Statistics</i>
</li>
<li>BJS Grad Student Readings - Statistics
</li>
<li>Elements of Statistical Learning
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-2">
<h2 id="sec-1-4">Syllabus</h2>
<div class="outline-text-2" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-3">
<h3 id="sec-1-4-1">Artificial Intelligence</h3>
<div class="outline-text-3" id="text-1-4-1">
<p>
My goals with learning Artificial Intelligence are a little bit less academic than the other categories in this document; I am currently more interested in getting the bat into my hands, so to speak, to use AI as a tool with which I can solve problems I am confronted with. Learning these things in a rigorous, disciplined manner is still important, but I lean less theoretical with this point on my self-imposed learning triangle compared to cogsci and math.
</p>
</div>

<div id="outline-container-sec-1-4-1-1" class="outline-4">
<h4 id="sec-1-4-1-1">Machine Learning and Artificial Intelligence</h4>
<div class="outline-text-4" id="text-1-4-1-1">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Pattern Recognition and Machine Learning (Bishop)
</li>
<li><code>[&#xa0;]</code> Artificial Intelligence: A Modern Approach (Russell and Norvig)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4-1-2" class="outline-4">
<h4 id="sec-1-4-1-2">Deep Learning</h4>
<div class="outline-text-4" id="text-1-4-1-2">
<ul class="org-ul">
<li><code>[X]</code> <i>deeplearning.ai</i>
</li>
<li><code>[&#xa0;]</code> <a href="https://www.deeplearningbook.org/">Deeplearningbook</a>
</li>
</ul>
</div>
</div>
