org/articles/learnmap.org
**** Reinforcement Learning
     - [X] David Silver's [[https://www.youtube.com/watch?v%3D2pWv7GOvuf0&list%3DPLqYmG7hTraZDM-OYHWgPebj2MfCFzFObQ][Introduction to Reinforcement Learning]]
     - [ ] Sutton and Barto [[http://incompleteideas.net/book/the-book-2nd.html][Reinforcement Learning: An Introduction]]

**** Smaller Fields
     - [X] Active Learning (Settles 2012)

*** Cognitive Science

This category is a sort of funny one since "Cognitive Science" is not completely entirely it's own discipline, so it's hard to know what explicitly belongs in this category (as opposed to, like, neuroscience or AI). For simplicity, this point in the hierarchy has my resources which either A: explicitly bridge gaps between multiple fields, or B: have more to do with the practice of science compared to a math / ml resource. Likewise, there is plenty in cognitive science that I want to read that doesn't fit well within the scope of this document (for example, /Psychology Applied to Modern Life/) just out of being somewhat irrelevant to the "computational" part I'm going for, so this list is intended to be somewhat more directed.

Likewise, for being a relatively young (and fragmented) field, I think an unusually important part of being a student in cognitive science is actually reading papers of researchers who interest you. It's not that you don't do this as a graduate-level student in any discipline, but for cognitive science in general you don't have that many options other than that (compare to math, where you can just read any number of textbooks for the hundreds of years of progress in mathematics).

As this document evolves I expect this section to grow the most; currently for brevity's sake I have /reading lists/ as the primary object in this section, but as I read things I think I will expand this to include actual papers that I think are "timeless enough" to serve as a useful entry for this syllabus, especially as I split this out into sub-fields.

**** Books and Textbooks
***** Computational Cognitive Science
      - [X] [[https://probmods.org/][Probabilistic Models of Cognition]] along with supplementary readings (see my [[http://planetbanatt.net/articles/probmods.html][notebook]])
      - [ ] Probabilistic Reasoning in Intelligent Systems (Pearl)
      - [ ] An Introduction to Decision Theory (Peterson)

***** Scientific Practice
      - [ ] Kuhn, T. S. (1970). The structure of scientific revolutions

**** Reading Lists
     - [ ] Brian Scholl [[http://perception.yale.edu/Brian/misc/musings/bjs-suggested-reading.html][Suggested Reading for CogSci Grad Students]] (mostly for general cognitive science methodology)
     - [ ] [[http://probcomp.csail.mit.edu/reading-list/][MIT Probabilistic Computing Project]] Readings

**** Course Syllabi w/ lists of readings
     - [ ] MIT The Brain and Cognitive Science [[https://ocw.mit.edu/courses/brain-and-cognitive-sciences/9-011-the-brain-and-cognitive-sciences-i-fall-2002/readings/][one]] and [[https://ocw.mit.edu/courses/brain-and-cognitive-sciences/9-012-the-brain-and-cognitive-sciences-ii-spring-2006/readings/][two]]
     - [ ] MIT Computational Cognitive Science [[https://ocw.mit.edu/courses/brain-and-cognitive-sciences/9-66j-computational-cognitive-science-fall-2004/readings/][readings]]
     - [ ] MIT Probability and Causality in Human Cognition [[https://ocw.mit.edu/courses/brain-and-cognitive-sciences/9-916-a-probability-and-causality-in-human-cognition-spring-2003/readings/][readings]]
     - [ ] MIT Statisical Learning Theory and Applications [[https://ocw.mit.edu/courses/brain-and-cognitive-sciences/9-520-statistical-learning-theory-and-applications-spring-2006/readings/][readings]]
     - [ ] MIT The Development of Object and Face Recognition [[https://ocw.mit.edu/courses/brain-and-cognitive-sciences/9-675-the-development-of-object-and-face-recognition-spring-2006/readings/][readings]]

**** Specific People I am Interested In
     - [ ] Josh Tenebaum
     - [ ] Noah Goodman

**** Papers

***** Scientific Methodology
      - Strong Inference - Platt 1964
      - Fuzzy Methodology - Cohen 1992
      - Why most published research findings are false - Ioannidis 2005
      - The head and the hands - Koenderink 2002
      - /Cigarette smoking: an underused tool in high-performance endurance training/ - Myers 2010

*** Math

Math learning resources are a bit more of an enigma to me because the amount of reading is so vast but comparatively more organized compared to other fields. Part of the fact that this is a self-instruction syllabus is that I just have no clue how good any of these resources are, despite there being so many. The below is probably enough to keep me busy for multiple years, even if I go very fast, and it definitely the least immediately clear to me how useful any of this will be (especially given that my colleagues are so skilled at math). 

That said, I think it's healthy to always be learning math /anyways/, so I am not particularly concerned if some of this is not super immediately applicable to my career. I expect a number of these to be slanted towards refreshing my knowledge of things I would claim to know (i.e. linear algebra) but strong mathematical fundamentals are important to have for artificial intelligence.

**** More Basic
     - [ ] The Art of Problem Solving Volumes I and II (Perhaps an embarrassing inclusion? But perhaps not)
     - [ ] How To Prove It (Velleman)

**** Higher 
     - [ ] [[http://web.evanchen.cc/napkin.html][An Infinitely Large Napkin]]
**** Fundamentals
     - [ ] Strang linear algebra
     - [ ] Apostol volume II
     - [ ] Principles of mathematical analysis (Rudin)

**** Statistics
***** Textbooks
      - [ ] [[https://web.stanford.edu/~hastie/Papers/ESLII.pdf][Elements of Statistical Learning]]
      - [ ] All of Statistics: A Concise Course in Statistical Inference 
***** Papers
      - [ ] [[http://perception.yale.edu/Brian/misc/musings/bjs-suggested-reading.html][Statistics readings (BJS)]]
      
