articles/learnmap.html

<div id="outline-container-sec-1-4-1-3" class="outline-4">
<h4 id="sec-1-4-1-3">Reinforcement Learning</h4>
<div class="outline-text-4" id="text-1-4-1-3">
<ul class="org-ul">
<li><code>[X]</code> David Silver's <a href="https://www.youtube.com/watch?v=2pWv7GOvuf0&list=PLqYmG7hTraZDM-OYHWgPebj2MfCFzFObQ">Introduction to Reinforcement Learning</a>
</li>
<li><code>[&#xa0;]</code> Sutton and Barto <a href="http://incompleteideas.net/book/the-book-2nd.html">Reinforcement Learning: An Introduction</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4-1-4" class="outline-4">
<h4 id="sec-1-4-1-4">Smaller Fields</h4>
<div class="outline-text-4" id="text-1-4-1-4">
<ul class="org-ul">
<li><code>[X]</code> Active Learning (Settles 2012)
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-2" class="outline-3">
<h3 id="sec-1-4-2">Cognitive Science</h3>
<div class="outline-text-3" id="text-1-4-2">
<p>
This category is a sort of funny one since "Cognitive Science" is not completely entirely it's own discipline, so it's hard to know what explicitly belongs in this category (as opposed to, like, neuroscience or AI). For simplicity, this point in the hierarchy has my resources which either A: explicitly bridge gaps between multiple fields, or B: have more to do with the practice of science compared to a math / ml resource. Likewise, there is plenty in cognitive science that I want to read that doesn't fit well within the scope of this document (for example, <i>Psychology Applied to Modern Life</i>) just out of being somewhat irrelevant to the "computational" part I'm going for, so this list is intended to be somewhat more directed.
</p>

<p>
Likewise, for being a relatively young (and fragmented) field, I think an unusually important part of being a student in cognitive science is actually reading papers of researchers who interest you. It's not that you don't do this as a graduate-level student in any discipline, but for cognitive science in general you don't have that many options other than that (compare to math, where you can just read any number of textbooks for the hundreds of years of progress in mathematics).
</p>

<p>
As this document evolves I expect this section to grow the most; currently for brevity's sake I have <i>reading lists</i> as the primary object in this section, but as I read things I think I will expand this to include actual papers that I think are "timeless enough" to serve as a useful entry for this syllabus, especially as I split this out into sub-fields.
</p>
</div>

<div id="outline-container-sec-1-4-2-1" class="outline-4">
<h4 id="sec-1-4-2-1">Books and Textbooks</h4>
<div class="outline-text-4" id="text-1-4-2-1">
</div><div id="outline-container-sec-1-4-2-1-1" class="outline-5">
<h5 id="sec-1-4-2-1-1">Computational Cognitive Science</h5>
<div class="outline-text-5" id="text-1-4-2-1-1">
<ul class="org-ul">
<li><code>[X]</code> <a href="https://probmods.org/">Probabilistic Models of Cognition</a> along with supplementary readings (see my <a href="http://planetbanatt.net/articles/probmods.html">notebook</a>)
</li>
<li><code>[&#xa0;]</code> Probabilistic Reasoning in Intelligent Systems (Pearl)
</li>
<li><code>[&#xa0;]</code> An Introduction to Decision Theory (Peterson)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4-2-1-2" class="outline-5">
<h5 id="sec-1-4-2-1-2">Scientific Practice</h5>
<div class="outline-text-5" id="text-1-4-2-1-2">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Kuhn, T. S. (1970). The structure of scientific revolutions
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-2-2" class="outline-4">
<h4 id="sec-1-4-2-2">Reading Lists</h4>
<div class="outline-text-4" id="text-1-4-2-2">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Brian Scholl <a href="http://perception.yale.edu/Brian/misc/musings/bjs-suggested-reading.html">Suggested Reading for CogSci Grad Students</a> (mostly for general cognitive science methodology)
</li>
<li><code>[&#xa0;]</code> <a href="http://probcomp.csail.mit.edu/reading-list/">MIT Probabilistic Computing Project</a> Readings
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4-2-3" class="outline-4">
<h4 id="sec-1-4-2-3">Course Syllabi w/ lists of readings</h4>
<div class="outline-text-4" id="text-1-4-2-3">
<ul class="org-ul">
<li><code>[&#xa0;]</code> MIT The Brain and Cognitive Science <a href="https://ocw.mit.edu/courses/brain-and-cognitive-sciences/9-011-the-brain-and-cognitive-sciences-i-fall-2002/readings/">one</a> and <a href="https://ocw.mit.edu/courses/brain-and-cognitive-sciences/9-012-the-brain-and-cognitive-sciences-ii-spring-2006/readings/">two</a>
</li>
<li><code>[&#xa0;]</code> MIT Computational Cognitive Science <a href="https://ocw.mit.edu/courses/brain-and-cognitive-sciences/9-66j-computational-cognitive-science-fall-2004/readings/">readings</a>
</li>
<li><code>[&#xa0;]</code> MIT Probability and Causality in Human Cognition <a href="https://ocw.mit.edu/courses/brain-and-cognitive-sciences/9-916-a-probability-and-causality-in-human-cognition-spring-2003/readings/">readings</a>
</li>
<li><code>[&#xa0;]</code> MIT Statisical Learning Theory and Applications <a href="https://ocw.mit.edu/courses/brain-and-cognitive-sciences/9-520-statistical-learning-theory-and-applications-spring-2006/readings/">readings</a>
</li>
<li><code>[&#xa0;]</code> MIT The Development of Object and Face Recognition <a href="https://ocw.mit.edu/courses/brain-and-cognitive-sciences/9-675-the-development-of-object-and-face-recognition-spring-2006/readings/">readings</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4-2-4" class="outline-4">
<h4 id="sec-1-4-2-4">Specific People I am Interested In</h4>
<div class="outline-text-4" id="text-1-4-2-4">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Josh Tenebaum
</li>
<li><code>[&#xa0;]</code> Noah Goodman
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4-2-5" class="outline-4">
<h4 id="sec-1-4-2-5">Papers</h4>
<div class="outline-text-4" id="text-1-4-2-5">
</div><div id="outline-container-sec-1-4-2-5-1" class="outline-5">
<h5 id="sec-1-4-2-5-1">Scientific Methodology</h5>
<div class="outline-text-5" id="text-1-4-2-5-1">
<ul class="org-ul">
<li>Strong Inference - Platt 1964
</li>
<li>Fuzzy Methodology - Cohen 1992
</li>
<li>Why most published research findings are false - Ioannidis 2005
</li>
<li>The head and the hands - Koenderink 2002
</li>
<li><i>Cigarette smoking: an underused tool in high-performance endurance training</i> - Myers 2010
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-3" class="outline-3">
<h3 id="sec-1-4-3">Math</h3>
<div class="outline-text-3" id="text-1-4-3">
<p>
Math learning resources are a bit more of an enigma to me because the amount of reading is so vast but comparatively more organized compared to other fields. Part of the fact that this is a self-instruction syllabus is that I just have no clue how good any of these resources are, despite there being so many. The below is probably enough to keep me busy for multiple years, even if I go very fast, and it definitely the least immediately clear to me how useful any of this will be (especially given that my colleagues are so skilled at math). 
</p>

<p>
That said, I think it's healthy to always be learning math <i>anyways</i>, so I am not particularly concerned if some of this is not super immediately applicable to my career. I expect a number of these to be slanted towards refreshing my knowledge of things I would claim to know (i.e. linear algebra) but strong mathematical fundamentals are important to have for artificial intelligence.
</p>
</div>

<div id="outline-container-sec-1-4-3-1" class="outline-4">
<h4 id="sec-1-4-3-1">More Basic</h4>
<div class="outline-text-4" id="text-1-4-3-1">
<ul class="org-ul">
<li><code>[&#xa0;]</code> The Art of Problem Solving Volumes I and II (Perhaps an embarrassing inclusion? But perhaps not)
</li>
<li><code>[&#xa0;]</code> How To Prove It (Velleman)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4-3-2" class="outline-4">
<h4 id="sec-1-4-3-2">Higher</h4>
<div class="outline-text-4" id="text-1-4-3-2">
<ul class="org-ul">
<li><code>[&#xa0;]</code> <a href="http://web.evanchen.cc/napkin.html">An Infinitely Large Napkin</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4-3-3" class="outline-4">
<h4 id="sec-1-4-3-3">Fundamentals</h4>
<div class="outline-text-4" id="text-1-4-3-3">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Strang linear algebra
</li>
<li><code>[&#xa0;]</code> Apostol volume II
</li>
<li><code>[&#xa0;]</code> Principles of mathematical analysis (Rudin)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4-3-4" class="outline-4">
<h4 id="sec-1-4-3-4">Statistics</h4>
<div class="outline-text-4" id="text-1-4-3-4">
</div><div id="outline-container-sec-1-4-3-4-1" class="outline-5">
<h5 id="sec-1-4-3-4-1">Textbooks</h5>
<div class="outline-text-5" id="text-1-4-3-4-1">
<ul class="org-ul">
<li><code>[&#xa0;]</code> <a href="https://web.stanford.edu/~hastie/Papers/ESLII.pdf">Elements of Statistical Learning</a>
</li>
<li><code>[&#xa0;]</code> All of Statistics: A Concise Course in Statistical Inference 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4-3-4-2" class="outline-5">
<h5 id="sec-1-4-3-4-2">Papers</h5>
<div class="outline-text-5" id="text-1-4-3-4-2">
<ul class="org-ul">
<li><code>[&#xa0;]</code> <a href="http://perception.yale.edu/Brian/misc/musings/bjs-suggested-reading.html">Statistics readings (BJS)</a>
</li>
</ul>
</div>
</div>
</div>
